# ReplaceParameter Method

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
FamilyManager..::..ReplaceParameter Method
FamilyManager Class See Also
---
# Overload List
| Name | Description |
| --- | --- |
| --- | --- | --- |
| ReplaceParameter(FamilyParameter, ExternalDefinition, BuiltInParameterGroup, Boolean) | **Obsolete.** Replace a family parameter with a shared parameter. |
| ReplaceParameter(FamilyParameter, ExternalDefinition, ForgeTypeId, Boolean) | Replace a family parameter with a shared parameter. |
| ReplaceParameter(FamilyParameter, String, BuiltInParameterGroup, Boolean) | **Obsolete.** Replace a shared family parameter with a new non-shared family parameter. |
| ReplaceParameter(FamilyParameter, String, ForgeTypeId, Boolean) | Replace a shared family parameter with a new non-shared family parameter. |

# See Also
FamilyManager Class
FamilyManager Members
Autodesk.Revit.DB Namespace